app/controllers/competences_controller.rb

SELECT "competences".* FROM "competences"
---
  def index
    @competences = Competence.all

INSERT INTO "competences" ("title", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["number", 1], ["created_at", "2020-05-28 16:29:42.450338"], ["updated_at", "2020-05-28 16:29:42.450338"]]
---
  def create
    @competence = Competence.new(competence_params)

    respond_to do |format|
      if @competence.save

SELECT "competences".* FROM "competences" WHERE "competences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_competence
      @competence = Competence.find(params[:id])