app/controllers/game_types_controller.rb

SELECT "game_types".* FROM "game_types"
---
  def index
    @game_types = GameType.all

INSERT INTO "game_types" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Ativo"], ["created_at", "2020-04-22 23:44:38.937905"], ["updated_at", "2020-04-22 23:44:38.937905"]]
---
  def create
    @game_type = GameType.new(game_type_params)

    respond_to do |format|
      if @game_type.save

UPDATE "game_types" SET "description" = ?, "updated_at" = ? WHERE "game_types"."id" = ?  [["description", "Instrução"], ["updated_at", "2020-04-22 23:46:14.697041"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @game_type.update(game_type_params)

SELECT "game_types".* FROM "game_types" WHERE "game_types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_game_type
      @game_type = GameType.find(params[:id])