app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all

SELECT "places".* FROM "places" WHERE "places"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_place
      @place = Place.find(params[:id])