app/controllers/scout_branches_controller.rb

  def index
    @scout_branches = ScoutBranch.all
---
SELECT "scout_branches".* FROM "scout_branches"

    def set_scout_branch
      @scout_branch = ScoutBranch.find(params[:id])
---
SELECT "scout_branches".* FROM "scout_branches" WHERE "scout_branches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]