app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "email", "password", "registration_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save